In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Social_Network_Ads.csv')
df.sample()

    User ID  Gender  Age  EstimatedSalary  Purchased
9  15727311  Female   35            65000          0

In [3]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

# We don't need User ID so remove it

In [5]:
new_df=df.iloc[:, 2:]
new_df.sample(2)

     Age  EstimatedSalary  Purchased
331   48           119000          1
383   49            28000          1

In [6]:
new_df['Age'].min(), new_df['Age'].max()

(np.int64(18), np.int64(60))

In [7]:
new_df['EstimatedSalary'].min(), new_df['EstimatedSalary'].max()

(np.int64(15000), np.int64(150000))

# Standardization

In [8]:
df['Age']

0      19
1      35
2      26
3      27
4      19
       ..
395    46
396    51
397    50
398    36
399    49
Name: Age, Length: 400, dtype: int64

In [9]:
age_mean = df['Age'].mean()
age_std = df['Age'].std()

age_mean, age_std

(np.float64(37.655), np.float64(10.482876597307914))

In [10]:
df['EstimatedSalary']

0      19000
1      20000
2      43000
3      57000
4      76000
       ...
395    41000
396    23000
397    20000
398    33000
399    36000
Name: EstimatedSalary, Length: 400, dtype: int64

In [12]:
sal_mean = df['EstimatedSalary'].mean()
sal_std = df['EstimatedSalary'].std()

sal_mean, sal_std

(np.float64(69742.5), np.float64(34096.960282424785))

In [15]:
df['std_Age'] = (df['Age']-age_mean)/age_std
df['std_EstimatedSalary'] = (df['EstimatedSalary']-sal_mean)/sal_std

df.head(5)

,User ID,Gender,Age,EstimatedSalary,Purchased,std_Age,std_EstimatedSalary
0,15624510,Male,19,19000,0,-1.779569,-1.488183
1,15810944,Male,35,20000,0,-0.253270,-1.458854
2,15668575,Female,26,43000,0,-1.111813,-0.784307
3,15603246,Female,27,57000,0,-1.016419,-0.373714
4,15804002,Male,19,76000,0,-1.779569,0.183521

In [14]:
df['std_Age'].mean()

np.float64(-1.4210854715202004e-16)

In [16]:
df['std_Age'].std()

np.float64(1.0)

In [17]:
df['std_EstimatedSalary'].mean()

np.float64(3.552713678800501e-17)

In [18]:
df['std_EstimatedSalary'].std()

np.float64(0.9999999999999999)